app/controllers/addresses_controller.rb

  def show
    @address = Address.find(params[:id])
---
SELECT * FROM `addresses` WHERE (`addresses`.`id` = 57)

  def create
    @address = Address.new(params[:address])
    if @address.save
---
INSERT INTO `addresses` (`line1`, `line2`, `updated_at`, `suburb_id`, `post_id`, `lng`, `lat`, `created_at`) VALUES(NULL, NULL, '2010-04-10 06:16:35', NULL, 44, NULL, NULL, '2010-04-10 06:16:35')