app/controllers/images_controller.rb

  def index
    @images = Image.all
---
SELECT * FROM `images`

  def show
    @image = Image.find(params[:id])
---
SELECT * FROM `images` WHERE (`images`.`id` = 1)

  def create
    @image = Image.new(params[:image])
    if @image.save
---
INSERT INTO `images` (`photo_file_name`, `photo_file_size`, `updated_at`, `photo_updated_at`, `post_id`, `photo_content_type`, `created_at`) VALUES('IMG_0927.JPG', 3064361, '2010-04-10 03:34:57', '2010-04-10 03:34:50', NULL, 'image/jpeg', '2010-04-10 03:34:57')

  def destroy
    @image = Image.find(params[:id])
    @image.destroy
---
SELECT * FROM `images` WHERE (`images`.`id` = 1)
DELETE FROM `images` WHERE `id` = 1