app/controllers/posts_controller.rb

SELECT * FROM `posts` LIMIT 0, 1
SELECT count(*) AS count_all FROM `posts`
---
  def index
    @posts = Post.paginate :page => params[:page], :per_page => 1

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def show
    @search = Search.new
    @post = Post.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `available_from` = '2010-03-19', `description` = 'Sample', `updated_at` = '2010-03-07 11:26:16', `expiry_date` = '2010-03-19' WHERE `id` = 1
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])