app/controllers/properties_controller.rb

SELECT * FROM `properties` WHERE (`properties`.`id` = 1)
---
  def show
    @property = Property.find(params[:id])

SELECT * FROM `properties` WHERE (`properties`.`id` = 1)
---
  def edit
    @property = Property.find(params[:id])

SELECT * FROM `properties` WHERE (`properties`.`id` = 1)
UPDATE `properties` SET `number_of_bedrooms` = 4, `updated_at` = '2010-03-07 11:27:18' WHERE `id` = 1
---
  def update
    @property = Property.find(params[:id])
    if @property.update_attributes(params[:property])