app/controllers/searches_controller.rb

  def show
    unless session[:search].nil?
      @search  = Search.new(session[:search])
    else
      @search ||= Search.new
      @search.build_property_search
    end
    @posts = @search.posts.paginate :page => params[:page], :per_page => 1
---
SELECT * FROM `properties` WHERE ((properties.number_of_carparks <= 2) AND ((properties.number_of_bathrooms >= 0) AND ((properties.price <= 1700.0) AND ((properties.number_of_carparks >= 1) AND ((properties.number_of_bedrooms <= 8) AND ((properties.price >= 250.0) AND ((properties.number_of_bathrooms <= 4) AND (properties.number_of_bedrooms >= 1))))))))
SELECT `posts`.* FROM `posts` INNER JOIN `addresses` ON addresses.post_id = posts.id INNER JOIN `suburbs` ON `suburbs`.id = `addresses`.suburb_id WHERE ((suburbs.name LIKE '%2134%') OR (suburbs.area LIKE '%2134%') OR (suburbs.state LIKE '%2134%') OR (suburbs.postcode LIKE '%2134%'))