app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`updated_at`, `crypted_password`, `perishable_token`, `username`, `password_salt`, `persistence_token`, `email`, `created_at`) VALUES('2010-03-07 11:16:31', 'b622e89d216aa3b0530d31428809960a067c32923fe472d5fec64bc842377716d8d9c90e22c8dc106ffb7d10456e852b5a8866c8db2080802930b9dd15a1c906', 'aaIINis857AYH0n-coO9', 'leomao', '_YSoc7KfYku9I575xkaw', 'd7302e476272926e5940519e4fc1b7297920c5efaea558aef3f9caaa473f57cc927c0c733b6c6e83cedc29f5aced3f136b7b8bae17ceccad50d3f6c51c759993', 'leoliang@hotmail.com', '2010-03-07 11:16:31')